templates/job/updatejob.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing"
    xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <a:Action s:mustUnderstand="1">http://www.ultipro.com/services/employeejob/IEmployeeJob/UpdateJob</a:Action>
        <UltiProToken xmlns="http://www.ultimatesoftware.com/foundation/authentication/ultiprotoken">e477967b-aa38-4187-a1a9-0849a8aab891</UltiProToken>
        <ClientAccessKey xmlns="http://www.ultimatesoftware.com/foundation/authentication/clientaccesskey">CAN12</ClientAccessKey>
    </s:Header>
    <s:Body>
        <UpdateJob xmlns="http://www.ultipro.com/services/employeejob">
            <entities xmlns:b="http://www.ultipro.com/contracts"
                xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <b:Job>
                    <b:Agricultural>false</b:Agricultural>
                    <b:AlternateTitle>Asssistant</b:AlternateTitle>
                    <b:DateInJob>0001-01-01T00:00:00</b:DateInJob>
                    <b:DirectLabor>false</b:DirectLabor>
                    <b:EffectiveDate>0001-01-01T00:00:00</b:EffectiveDate>
                    <b:EmployeeIdentifier i:type="b:EmployeeNumberIdentifier">
                        <b:CompanyCode i:nil="true" />
                        <b:EmployeeNumber i:nil="true" />
                    </b:EmployeeIdentifier>
                    <b:EmployeeType i:nil="true" />
                    <b:FullOrPartTime>Full-time</b:FullOrPartTime>
                    <b:HourlyOrSalaried i:nil="true" />
                    <b:JobCode i:nil="true" />
                    <b:JobGroup i:nil="true" />
                    <b:LocalUnion i:nil="true" />
                    <b:NationalUnion i:nil="true" />
                    <b:OrgLevel1 i:nil="true" />
                    <b:OrgLevel2 i:nil="true" />
                    <b:OrgLevel3 i:nil="true" />
                    <b:OrgLevel4 i:nil="true" />
                    <b:PayFrequency i:nil="true" />
                    <b:PayGroup i:nil="true" />
                    <b:PayScaleCode>ABC</b:PayScaleCode>
                    <b:Project i:nil="true" />
                    <b:Promotion>false</b:Promotion>
                    <b:ReasonCode i:nil="true" />
                    <b:ScheduledHours>0</b:ScheduledHours>
                    <b:Seasonal>false</b:Seasonal>
                    <b:SelfServiceProperties xmlns:c="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
                        <c:KeyValueOfstringstring>
                            <c:Key />
                            <c:Value />
                        </c:KeyValueOfstringstring>
                    </b:SelfServiceProperties>
                    <b:ShiftCode i:nil="true" />
                    <b:ShiftGroup i:nil="true" />
                    <b:StepNo>1</b:StepNo>
                    <b:Supervisor i:nil="true" />
                    <b:TimeClock i:nil="true" />
                    <b:Transfer>false</b:Transfer>
                    <b:YouthTraining>false</b:YouthTraining>
                </b:Job>
            </entities>
        </UpdateJob>
    </s:Body>
</s:Envelope>